app/controllers/products_controller.rb

  def create
    @produc = Product.create(product_params)
---
INSERT INTO "products" ("name", "price", "created_at", "updated_at", "inventory", "description") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Books"], ["price", 4], ["created_at", "2019-06-28 17:09:41.409012"], ["updated_at", "2019-06-28 17:09:41.409012"], ["inventory", 4], ["description", "test"]]